ИИ_Агент/src/Enums/ИИА_АвторСообщения/ИИА_АвторСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_АвторСообщения</name>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ИИ</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/Catalogs/ИИА_Диалоги/ИИА_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИИА_Диалоги</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиалога</name>
    <type>
      <types>EnumRef.ИИА_ТипДиалога</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>EnumRef.ИИА_АвторСообщения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСообщения</name>
      <type>
        <types>EnumRef.ИИА_ТипСообщения</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстКода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UsageTokens</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусDSL</name>
      <type>
        <types>EnumRef.ИИА_СтатусDSL</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗадачаВыполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмененныеОбъекты</name>
    <attributes>
      <name>СсылкаНаОбъект</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИИ_Агент/src/CommonModules/ИИА_ВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Находит или создает диалог пользователя
//
// Параметры:
//  Пользователь - Строка - пользователь
//
// Возвращаемое значение:
//  СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Функция НайтиИлиСоздатьДиалогПользователя(Пользователь) Экспорт
	
	Возврат ИИА_Сервер.НайтиИлиСоздатьДиалогПользователя(Пользователь);
	
КонецФункции

// Деактивирует диалог на сервере
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Процедура ДеактивироватьДиалог(СсылкаДиалога) Экспорт
	
	ИИА_Сервер.ДеактивироватьДиалог(СсылкаДиалога);
	
КонецПроцедуры

// Создает новый диалог для пользователя на сервере
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь
//  ТипДиалога - ПеречислениеСсылка.ИИА_ТипДиалога - тип диалога
//
// Возвращаемое значение:
//  СправочникСсылка.ИИА_Диалоги - ссылка на новый диалог
//
Функция СоздатьНовыйДиалог(Пользователь, ТипДиалога = Неопределено) Экспорт
	
	Возврат ИИА_Сервер.СоздатьНовыйДиалог(Пользователь, ТипДиалога);
	
КонецФункции

// Получает сообщения диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Количество - Число - количество сообщений (0 - все)
//
// Возвращаемое значение:
//  Массив - массив структур с сообщениями
//
Функция ПолучитьСообщенияДиалога(СсылкаДиалога, Количество = 0) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьСообщенияДиалога(СсылкаДиалога, Количество);
	
КонецФункции

// Отправляет сообщение и получает ответ от ИИ
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТипСообщения - Строка - тип сообщения
//  Текст - Строка - текст сообщения
//
// Возвращаемое значение:
//  Структура - структура ответа
//
Функция ОтправитьСообщениеСервера(СсылкаДиалога, ТипСообщения, Текст) Экспорт
	
	Возврат ИИА_Сервер.ОтправитьСообщениеСервера(СсылкаДиалога, ТипСообщения, Текст);
	
КонецФункции

// Проверяет запрос 1С
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса
//
// Возвращаемое значение:
//  Структура - структура результата
//
Функция ПроверитьЗапрос(ТекстЗапроса) Экспорт
	
	Возврат ИИА_Сервер.ПроверитьЗапрос(ТекстЗапроса);
	
КонецФункции

// Добавляет системное сообщение в диалог
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Текст - Строка - текст сообщения
//  ТипСообщения - ПеречислениеСсылка.ИИА_ТипСообщения - тип сообщения
//
Процедура ДобавитьСистемноеСообщениеНаСервере(СсылкаДиалога, Текст, ТипСообщения) Экспорт
	
	ИИА_Сервер.ДобавитьСообщениеВДиалог(
		СсылкаДиалога,
		Перечисления.ИИА_АвторСообщения.Система,
		ТипСообщения,
		Текст,
		"",
		"",
		0
	);
	
КонецПроцедуры

// Выполняет DSL-сценарий и добавляет системные сообщения в диалог
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  DSLJSON - Строка - JSON с DSL командами
//
// Возвращаемое значение:
//  Структура - структура результата выполнения DSL
//
Функция ВыполнитьDSLСценарий(СсылкаДиалога, DSLJSON) Экспорт
	
	Возврат ИИА_Сервер.ВыполнитьDSLСценарийССообщениями(СсылкаДиалога, DSLJSON);
	
КонецФункции

// Выполняет DSL-сценарий без добавления сообщений в диалог
//
// Параметры:
//  DSLJSON - Строка - JSON с DSL командами
//
// Возвращаемое значение:
//  Структура - структура результата выполнения DSL
//
Функция ВыполнитьDSLСценарийБезСообщений(DSLJSON, СсылкаДиалога = Неопределено) Экспорт
	
	Возврат ИИА_Сервер.ВыполнитьDSLСценарийБезСообщений(DSLJSON, СсылкаДиалога);
	
КонецФункции

// Исправляет DSL-сценарий через ИИ при ошибке выполнения (использует обычную функцию ВызватьИИ)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТекстОшибки - Строка - текст ошибки
//  ИсходныйDSL - Строка - исходный DSL-сценарий
//
// Возвращаемое значение:
//  Структура - структура ответа от ВызватьИИ (содержит DSL в поле DSL или Текст)
//
Функция ИсправитьDSLЧерезИИ(СсылкаДиалога, ТекстОшибки, ИсходныйDSL) Экспорт
	
	Возврат ИИА_Сервер.ИсправитьDSLЧерезИИ(СсылкаДиалога, ТекстОшибки, ИсходныйDSL);
	
КонецФункции

// Обновляет статус DSL в последнем сообщении диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  НовыйСтатус - ПеречислениеСсылка.ИИА_СтатусDSL - новый статус DSL
//
Процедура ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, НовыйСтатус) Экспорт
	
	ИИА_Сервер.ОбновитьСтатусDSLВПоследнемСообщении(СсылкаДиалога, НовыйСтатус);
	
КонецПроцедуры

// Извлекает DSL JSON из текста ответа ИИ
//
// Параметры:
//  Текст - Строка - текст, из которого нужно извлечь JSON
//
// Возвращаемое значение:
//  Строка - извлеченный JSON или пустая строка, если не найден
//
Функция ИзвлечьDSLИзОтвета(Текст) Экспорт
	
	Возврат ИИА_Провайдеры.ИзвлечьDSLИзТекста(Текст);
	
КонецФункции

// Проверяет результат выполнения задачи через ИИ
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТекстЗадачиПользователя - Строка - исходный текст задачи пользователя
//  РезультатDSL - Структура - результат выполнения DSL-сценария
//
// Возвращаемое значение:
//  Булево - Истина, если задача выполнена, Ложь - если нет
//
Функция ПроверитьРезультатВыполненияЗадачи(СсылкаДиалога, ТекстЗадачиПользователя, РезультатDSL) Экспорт
	
	Возврат ИИА_Сервер.ПроверитьРезультатВыполненияЗадачи(СсылкаДиалога, ТекстЗадачиПользователя, РезультатDSL, Неопределено);
	
КонецФункции

// Получает первое сообщение пользователя из диалога (исходную задачу)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Структура - структура с информацией о первом сообщении пользователя
//
Функция ПолучитьПервоеСообщениеПользователя(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьПервоеСообщениеПользователя(СсылкаДиалога);
	
КонецФункции

// Получает последнее сообщение пользователя из диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Структура - структура с информацией о последнем сообщении пользователя
//
Функция ПолучитьПоследнееСообщениеПользователя(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьПоследнееСообщениеПользователя(СсылкаДиалога);
	
КонецФункции

// Получает все невыполненные задачи и уточнения пользователя из диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Структура - структура с информацией о невыполненных задачах
//
Функция ПолучитьНевыполненныеЗадачиПользователя(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьНевыполненныеЗадачиПользователя(СсылкаДиалога);
	
КонецФункции

// Вызывает ИИ с системным сообщением (не от пользователя)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТипСообщения - Строка - тип сообщения
//  ТекстСистемногоСообщения - Строка - текст системного сообщения
//
// Возвращаемое значение:
//  Структура - структура ответа
//
Функция ВызватьИИССистемнымСообщением(СсылкаДиалога, ТипСообщения, ТекстСистемногоСообщения) Экспорт
	
	Возврат ИИА_Сервер.ВызватьИИССистемнымСообщением(СсылкаДиалога, ТипСообщения, ТекстСистемногоСообщения);
	
КонецФункции

// Получает последнее DSL сообщение и его статус
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Структура - структура с информацией о последнем DSL сообщении
//
Функция ПолучитьПоследнееDSLСообщение(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьПоследнееDSLСообщение(СсылкаДиалога);
	
КонецФункции

// Получает общее количество использованных токенов в диалоге
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Число - общее количество использованных токенов
//
Функция ПолучитьОбщееКоличествоТокенов(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьОбщееКоличествоТокенов(СсылкаДиалога);
	
КонецФункции

// Сохраняет лог в справочник ИИА_Диалоги
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТекстЛога - Строка - текст лога для сохранения
//
Процедура СохранитьЛогДиалога(СсылкаДиалога, ТекстЛога) Экспорт
	
	ИИА_Сервер.СохранитьЛогДиалога(СсылкаДиалога, ТекстЛога);
	
КонецПроцедуры

// Получает лог из справочника ИИА_Диалоги
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Строка - текст лога
//
Функция ПолучитьЛогДиалога(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьЛогДиалога(СсылкаДиалога);
	
КонецФункции

// Добавляет запись в лог диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ЗаписьЛога - Строка - текст записи для добавления
//
Процедура ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ЗаписьЛога) Экспорт
	
	ИИА_Сервер.ДобавитьЗаписьВЛогДиалога(СсылкаДиалога, ЗаписьЛога);
	
КонецПроцедуры

// Возвращает строковое описание диалога (Код, Имя, Дата, Активный)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Строка - описание диалога
//
Функция ПолучитьОписаниеДиалога(СсылкаДиалога) Экспорт
	
	Если СсылкаДиалога = Неопределено ИЛИ СсылкаДиалога.Пустая() Тогда
		Возврат "Диалог не выбран";
	КонецЕсли;
	
	Описание = "";
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диалоги.Код КАК Код,
		|	Диалоги.Имя КАК Имя,
		|	Диалоги.ДатаСоздания КАК ДатаСоздания,
		|	Диалоги.Активный КАК Активный
		|ИЗ
		|	Справочник.ИИА_Диалоги КАК Диалоги
		|ГДЕ
		|	Диалоги.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаДиалога);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Описание = "Код: " + Выборка.Код + ", Дата: " + Выборка.ДатаСоздания + ", Активный: " + Выборка.Активный;
			Если ЗначениеЗаполнено(Выборка.Имя) Тогда
				Описание = Описание + ", Имя: " + Выборка.Имя;
			КонецЕсли;
		Иначе
			Описание = "Диалог не найден в базе";
		КонецЕсли;
	Исключение
		Описание = "Ошибка получения данных: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Описание;
	
КонецФункции

// Создает табличный документ из массива структур с данными запроса
//
// Параметры:
//  ДанныеЗапроса - Массив - массив структур с данными запроса
//
// Возвращаемое значение:
//  ТабличныйДокумент - созданный табличный документ
//
Функция СоздатьТабличныйДокументИзДанных(ДанныеЗапроса) Экспорт
	
	Возврат ИИА_Сервер.СоздатьТабличныйДокументИзДанных(ДанныеЗапроса);
	
КонецФункции

// Генерирует summary (резюме) выполненной работы через ИИ
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Строка - текст summary или пустая строка при ошибке
//
Функция СгенерироватьSummary(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.СгенерироватьSummary(СсылкаДиалога);
	
КонецФункции

// Получает список ключей из хранилища значений диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Массив - массив строк с ключами хранилища
//
Функция ПолучитьКлючиХранилища(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьКлючиХранилища(СсылкаДиалога);
	
КонецФункции

// Генерирует продолжение выполнения задачи (следующий шаг)
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
// Возвращаемое значение:
//  Булево - Истина, если успешно сгенерирован новый шаг
//
Функция СгенерироватьПродолжениеВыполнения(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.СгенерироватьПродолжениеВыполнения(СсылкаДиалога);
	
КонецФункции

// Сохраняет результат проверки задачи в хранилище диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Успех - Булево - результат проверки
//  Причина - Строка - пояснение
//
Процедура УстановитьРезультатПроверки(СсылкаДиалога, Успех, Причина) Экспорт
	
	ИИА_Сервер.УстановитьРезультатПроверкиВХранилище(СсылкаДиалога, Успех, Причина);
	
КонецПроцедуры

// Сбрасывает результат проверки задачи в хранилище диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Процедура СброситьРезультатПроверки(СсылкаДиалога) Экспорт
	
	ИИА_Сервер.СброситьРезультатПроверкиВХранилище(СсылкаДиалога);
	
КонецПроцедуры

// Возвращает структуру с результатом проверки задачи из хранилища диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Функция ПолучитьРезультатПроверки(СсылкаДиалога) Экспорт
	
	Возврат ИИА_Сервер.ПолучитьРезультатПроверкиИзХранилища(СсылкаДиалога);
	
КонецФункции

#КонецОбласти
